In [1]:
import pandas as pd

df = pd.DataFrame([1,2,3,4,5])
df

   0
0  1
1  2
2  3
3  4
4  5

In [2]:
# 열 추가 :player => 'sonny','lee','kim','hwang','park'

df['player'] = ['sonny','lee','kim','hwang','park']
df

   0 player
0  1  sonny
1  2    lee
2  3    kim
3  4  hwang
4  5   park

In [4]:
df.columns

Index([0, 'player'], dtype='object')

In [5]:
# 컬럽 이름 수정
df.columns = ['no','player']
df

   no player
0   1  sonny
1   2    lee
2   3    kim
3   4  hwang
4   5   park

In [6]:
df.values

# 리스트 타입 형태이며, 데이터 값만 나온다.
# "리스트 안에 리스트가 있다." => 2차원 리스트

array([[1, 'sonny'],
       [2, 'lee'],
       [3, 'kim'],
       [4, 'hwang'],
       [5, 'park']], dtype=object)

In [7]:
# 2차원 리스트 -> 데이터프레임
# 데이터가 여러개 있을 때는 list 형태로
list = [[7,'sonny'],
        [10,'lee'],
        [3,'kim']]

list

[[7, 'sonny'], [10, 'lee'], [3, 'kim']]

In [8]:
# list -> df으로 변환
df = pd.DataFrame(list)
df
# df 는 그저 변수명인것을 참고하라

    0      1
0   7  sonny
1  10    lee
2   3    kim

In [9]:
# column 명 바꾸기
df.columns = ['no','player']
df

   no player
0   7  sonny
1  10    lee
2   3    kim

In [10]:
# 딕셔너리 -> 데이터프레임
dict = {
    'name':['sonny','kangin','minjae','channy'],
    'no':[7,9,3,10],
    'age':[32,23,28,28]
}

dict
#딕셔너리 타입을 데이터프레임으로 { 키(열이름):value(데이터) }

{'name': ['sonny', 'kangin', 'minjae', 'channy'],
 'no': [7, 9, 3, 10],
 'age': [32, 23, 28, 28]}

In [11]:
df = pd.DataFrame(dict)
df

     name  no  age
0   sonny   7   32
1  kangin   9   23
2  minjae   3   28
3  channy  10   28

In [12]:
# 데이터프레임 크기
df.shape

(4, 3)

In [13]:
# 데이터프레임 처음 3행 출력
df.head(3)

     name  no  age
0   sonny   7   32
1  kangin   9   23
2  minjae   3   28

In [14]:
# 데이터프레임 끝 3행 출력
df.tail(3)

     name  no  age
1  kangin   9   23
2  minjae   3   28
3  channy  10   28

In [16]:
# 데이터 속성 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   no      4 non-null      int64
 2   age     4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [17]:
# 데이터프레임 기술 통계
df.describe()

# 데이터 받으면 핸들링 하기전의 기본 자세
## shape -> head() or tail() -> info() -> describe()

              no        age
count   4.000000   4.000000
mean    7.250000  27.750000
std     3.095696   3.685557
min     3.000000  23.000000
25%     6.000000  26.750000
50%     8.000000  28.000000
75%     9.250000  29.000000
max    10.000000  32.000000

In [18]:
# 열 추가
df['weight'] = [75,60,80,80]
df

     name  no  age  weight
0   sonny   7   32      75
1  kangin   9   23      60
2  minjae   3   28      80
3  channy  10   28      80

In [19]:
df['height'] = [180,171,190,179]
df

     name  no  age  weight  height
0   sonny   7   32      75     180
1  kangin   9   23      60     171
2  minjae   3   28      80     190
3  channy  10   28      80     179

In [20]:
# 특정 열 선택 출력
df['name']

0     sonny
1    kangin
2    minjae
3    channy
Name: name, dtype: object

In [21]:
# 특정 행 선택 출력
df.loc[1]

name      kangin
no             9
age           23
weight        60
height       171
Name: 1, dtype: object

In [26]:
# exel 파일 받기
df_exl = pd.read_excel('C:/Users/SAMSUNG/Desktop/big_data_blog/06week/transportation.xlsx') # 상대경로x
df_exl # 'sheet_name =' 없이 적으면 첫번째 sheet 만 출력

    대중교통구분    노선명      년월   승차총승객수
0      지하철    1호선  201711  8633618
1      지하철    1호선  201712  8737235
2      지하철    1호선  201801  8145989
3      지하철    1호선  201802  7273309
4      지하철    1호선  201803  8692551
..     ...    ...     ...      ...
596    지하철  우이신설선  201901  1263643
597    지하철  우이신설선  201902  1102109
598    지하철  우이신설선  201903  1402393
599    지하철  우이신설선  201904  1403115
600    지하철  우이신설선  201905  1469681

[601 rows x 4 columns]

In [28]:
# 데이터 프레임 크기
df_exl.shape

(601, 4)

In [29]:
# 데이터프레임 데이터 앞 3개 출력
df_exl.head(3)

  대중교통구분  노선명      년월   승차총승객수
0    지하철  1호선  201711  8633618
1    지하철  1호선  201712  8737235
2    지하철  1호선  201801  8145989

In [30]:
# 데이터프레임 데이터 뒤 3개 출력
df_exl.tail(3)

    대중교통구분    노선명      년월   승차총승객수
598    지하철  우이신설선  201903  1402393
599    지하철  우이신설선  201904  1403115
600    지하철  우이신설선  201905  1469681

In [33]:
# 특정 sheet 변경
df_exl_bus = pd.read_excel('C:/Users/SAMSUNG/Desktop/big_data_blog/06week/transportation.xlsx', sheet_name='버스')
df_exl_bus

   대중교통구분      년월     승차총승객수
0      버스  201711  163443126
1      버스  201712  162521011
2      버스  201801  153335185
3      버스  201802  134768582
4      버스  201803  166177855
5      버스  201804  160452595
6      버스  201805  164390595
7      버스  201806  156999747
8      버스  201807  163736112
9      버스  201808  160240197
10     버스  201809  151311657
11     버스  201810  165820934
12     버스  201811  163017758
13     버스  201812  158049446
14     버스  201901  153037549
15     버스  201902  131621925
16     버스  201903  161694445
17     버스  201904  161900273
18     버스  201905  166587933

In [32]:
df_exl = pd.read_excel('C:/Users/SAMSUNG/Desktop/big_data_blog/06week/transportation.xlsx') # 상대경로x
df_exl

    대중교통구분    노선명      년월   승차총승객수
0      지하철    1호선  201711  8633618
1      지하철    1호선  201712  8737235
2      지하철    1호선  201801  8145989
3      지하철    1호선  201802  7273309
4      지하철    1호선  201803  8692551
..     ...    ...     ...      ...
596    지하철  우이신설선  201901  1263643
597    지하철  우이신설선  201902  1102109
598    지하철  우이신설선  201903  1402393
599    지하철  우이신설선  201904  1403115
600    지하철  우이신설선  201905  1469681

[601 rows x 4 columns]

In [34]:
# 특정 열 출력
df_exl['노선명']

0        1호선
1        1호선
2        1호선
3        1호선
4        1호선
       ...
596    우이신설선
597    우이신설선
598    우이신설선
599    우이신설선
600    우이신설선
Name: 노선명, Length: 601, dtype: object

In [35]:
# 중복 제거 - 많은 데이터 중 중복을 제거
unique_data = df_exl['노선명'].unique()
unique_data

array(['1호선', '2호선', '3호선', '4호선', '경부선', '경인선', '경원선', '안산선', '과천선',
       '분당선', '일산선', '중앙선', '장항선', '경의선', '경춘선', '수인선', '경강선', '서해선',
       '5호선', '6호선', '7호선', '8호선', '인천1호선', '인천2호선', '9호선', '공항철도 1호선',
       '신분당선', '9호선2~3단계', '용인에버라인', '의정부경전철', '경기철도', '우이신설선'],
      dtype=object)

In [36]:
# 특정 열, data 출력
df_exl.loc[100,'승차총승객수']

10356250

In [37]:
df_exl.iloc[100,3]

10356250

In [38]:
# loc 슬라이싱 (시작:끝)
df_exl.loc[0:5]

  대중교통구분  노선명      년월   승차총승객수
0    지하철  1호선  201711  8633618
1    지하철  1호선  201712  8737235
2    지하철  1호선  201801  8145989
3    지하철  1호선  201802  7273309
4    지하철  1호선  201803  8692551
5    지하철  1호선  201804  8275767

In [39]:
# 0~5번 행 슬라이싱 + 열은 '승차총승객수','대중교통구분'
df_exl.loc[0:5,['승차총승객수','대중교통구분']]

    승차총승객수 대중교통구분
0  8633618    지하철
1  8737235    지하철
2  8145989    지하철
3  7273309    지하철
4  8692551    지하철
5  8275767    지하철

In [40]:
# csv 파일 받아오기
df_csv = pd.read_csv('C:/Users/SAMSUNG/Desktop/big_data_blog/06week/pythonBook.csv',sep=',',encoding='cp949')
df_csv
# csv 파일은 한글을 지원하기 위해 인코딩 옵션을 주면 된다.

,책이름,저자,출판사,출간일,가격
0,Do it! 점프 투 파이썬,박응용,이지스퍼블리싱,2019년 06월,"16,920"
1,혼자 공부하는 머신러닝+딥러닝,박해선,한빛미디어,2020년 12월,"23,400"
2,혼자 공부하는 파이썬,윤인성,한빛미디어,2019년 06월,"16,200"
3,이것이 취업을 위한 코딩 테스트다 with 파이썬,나동빈,한빛미디어,2020년 08월,"30,600"
4,비전공자도 이해할 수 있는 AI 지식,박상길,반니,2022년 03월,"17,820"
...,...,...,...,...,...
739,스펙트럼 머신러닝 with 파이썬,장철원,비제이퍼블릭(BJ퍼블릭),2021년 12월,"64,350"
740,당신이 지금 알아야 할 클라우드 세트,이영호,비제이퍼블릭(BJ퍼블릭),2020년 10월,"142,200"
741,Step by Step 파이썬 비즈니스 통계분석,김형수,프레딕스,2021년 11월,"32,000"
742,머신러닝 알고리듬 트레이딩,스테판 젠슨,에이콘출판사,2021년 09월,"76,500"
743,머신러닝 알고리즘 트레이딩,세바스티앙 도나디오,에이콘출판사,0001년 01월,"70,200"

In [41]:
# 데이터 크기
df_csv.shape

(744, 5)

In [42]:
# 데이터 타입 정보
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 744 entries, 0 to 743
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   책이름     744 non-null    object
 1   저자      744 non-null    object
 2   출판사     744 non-null    object
 3   출간일     744 non-null    object
 4   가격      744 non-null    object
dtypes: object(5)
memory usage: 29.2+ KB

In [43]:
# 중복 제거
unique_data_csv = df_csv['출판사'].unique()
unique_data_csv

array(['이지스퍼블리싱', '한빛미디어', '반니', '길벗', '앤써북', '책만', '생능출판사', '위키북스',
       '파이스탁', '정보문화사', '비제이퍼블릭(BJ퍼블릭)', '한빛아카데미', '생능북스', '에이콘출판사',
       '인포앤북', '골든래빗', '인피니티북스', '로드북', '제이펍', '영진닷컴', '터닝포인트', '오렌지미디어',
       '루비페이퍼', '시대고시기획 시대교육', '삼양미디어', '인사이트(insight)', '자유아카데미', '구미서관',
       'BOOKK(부크크)', '연두에디션', '복두출판사', '광문각', '잇플ITPLE', '삼일인포마인', '프리렉',
       '아이콕스(iCox)', '성안당', '씨마스', '홍릉과학출판사', '서울대학교출판문화원', '씨마스21',
       '코딩엑스', '햄큐(HAMQ)', '이한미디어', '부산대학교출판문화원', '디지털북스', '북스홀릭퍼블리싱',
       '동양북스(동양books)', '명진씨앤피', '가메출판사', 'REXmedia(렉스미디어)', '남가람북스',
       '아이씨뱅큐', '미리어드스페이스', '21세기사', '한양대학교출판부', '휴먼싸이언스', '오일러', '코딩타임',
       '가치랩스', '서현사', '늘봄', '책밥', '아티오', '홍릉', '심통', '지오북스', '한국정보인재개발원',
       '범', '시그마프레스', '씨아이알(CIR)', '교학사', '내하출판사', '정익사',
       '스토리조아(STORYJOA)', '좋은땅', '아이리포', '성진미디어', '코쿤아우트', '비팬북스(러닝스페이스)',
       '도수서원', '(주)코딩스쿨', '그린 (윤덕우)', '디스커버리미디어', 'AK(에이케이 커뮤니케이션즈)',
       '지오아카데미', '스포트라잇북', '그린', '글로벌', 'e비즈북스', '혜지원', '한티에듀', '인디라이프',
       '시대인', '에듀웨이', '카오스북', '(주)박영사', '와이북스', '다올미디어', '한나래', '일진사',
       '한경사', '원펀치', '기한재', '상학당', '앤아이컴즈', 'UUP', '플랜투비아이플러스',
       '부산대학교출판부(PNU Press)', '지앤선(志&嬋)', '경문사', '창조와지식', '크라운출판사',
       '지식과감성#', '영남대학교출판부(知YU智)', '노드미디어', '출판사Bogook(출판사보국)',
       '한성대학교출판부', '더코딩칼리지', '북스힐', '지란지교에듀랩', '에피스테메(방송대출판문화원)',
       '서울시립대학교출판부', '북랩', '고시고시', '구민사', '넥서스', '이모션미디어', '(유)캐멀컨설팅',
       '프레딕스'], dtype=object)